{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.17.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 47], "dtype": "float32", "sparse": false, "ragged": false, "name": "bidirectional_7_input"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_7", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_21", "trainable": true, "batch_input_shape": [null, 15, 47], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "LSTM", "config": {"name": "lstm_22", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_23", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "AUC", "config": {"name": "auc_7", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "label_weights": null}}, {"class_name": "Precision", "config": {"name": "precision_7", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall_7", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.00020000000949949026, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_7/forward_lstm_21/lstm_cell_76/kernel", "shape": [47, 256], "dtype": "float32"}, {"name": "bidirectional_7/forward_lstm_21/lstm_cell_76/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_7/forward_lstm_21/lstm_cell_76/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_7/backward_lstm_21/lstm_cell_77/kernel", "shape": [47, 256], "dtype": "float32"}, {"name": "bidirectional_7/backward_lstm_21/lstm_cell_77/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_7/backward_lstm_21/lstm_cell_77/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_22/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_22/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_23/kernel", "shape": [16, 2], "dtype": "float32"}, {"name": "dense_23/bias", "shape": [2], "dtype": "float32"}, {"name": "lstm_22/lstm_cell_78/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_22/lstm_cell_78/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_22/lstm_cell_78/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_23/lstm_cell_79/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "lstm_23/lstm_cell_79/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm_23/lstm_cell_79/bias", "shape": [256], "dtype": "float32"}]}]}