{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 51], "dtype": "float32", "sparse": false, "ragged": false, "name": "landmark_input"}, "name": "landmark_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "angle_input"}, "name": "angle_input", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_8", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_L1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 2}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 3}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 4}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_8", "inbound_nodes": [[["landmark_input", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_10", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_A1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 8}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 9}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 10}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_10", "inbound_nodes": [[["angle_input", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_9", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_L2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 14}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 15}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 16}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_9", "inbound_nodes": [[["bidirectional_8", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_11", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_A2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 20}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 21}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 22}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_11", "inbound_nodes": [[["bidirectional_10", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "LSTM_L3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 26}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 27}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 28}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "LSTM_L3", "inbound_nodes": [[["bidirectional_9", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "LSTM_A3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 31}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 32}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 33}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "LSTM_A3", "inbound_nodes": [[["bidirectional_11", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["LSTM_L3", 0, 0, {}], ["LSTM_A3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}], "input_layers": [["landmark_input", 0, 0], ["angle_input", 0, 0]], "output_layers": [["dense_8", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "AUC", "config": {"name": "auc_2", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "label_weights": null}}, {"class_name": "Precision", "config": {"name": "precision_2", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall_2", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "LSTM_A3/lstm_cell_83/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "LSTM_A3/lstm_cell_83/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "LSTM_A3/lstm_cell_83/bias", "shape": [256], "dtype": "float32"}, {"name": "LSTM_L3/lstm_cell_82/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "LSTM_L3/lstm_cell_82/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "LSTM_L3/lstm_cell_82/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_10/forward_bidirectional_A1/lstm_cell_74/kernel", "shape": [10, 256], "dtype": "float32"}, {"name": "bidirectional_10/forward_bidirectional_A1/lstm_cell_74/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_10/forward_bidirectional_A1/lstm_cell_74/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_10/backward_bidirectional_A1/lstm_cell_75/kernel", "shape": [10, 256], "dtype": "float32"}, {"name": "bidirectional_10/backward_bidirectional_A1/lstm_cell_75/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_10/backward_bidirectional_A1/lstm_cell_75/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_11/forward_bidirectional_A2/lstm_cell_80/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_11/forward_bidirectional_A2/lstm_cell_80/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_11/forward_bidirectional_A2/lstm_cell_80/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_11/backward_bidirectional_A2/lstm_cell_81/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_11/backward_bidirectional_A2/lstm_cell_81/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_11/backward_bidirectional_A2/lstm_cell_81/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_8/forward_bidirectional_L1/lstm_cell_71/kernel", "shape": [51, 256], "dtype": "float32"}, {"name": "bidirectional_8/forward_bidirectional_L1/lstm_cell_71/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_8/forward_bidirectional_L1/lstm_cell_71/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_8/backward_bidirectional_L1/lstm_cell_72/kernel", "shape": [51, 256], "dtype": "float32"}, {"name": "bidirectional_8/backward_bidirectional_L1/lstm_cell_72/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_8/backward_bidirectional_L1/lstm_cell_72/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_9/forward_bidirectional_L2/lstm_cell_77/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_9/forward_bidirectional_L2/lstm_cell_77/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_9/forward_bidirectional_L2/lstm_cell_77/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_9/backward_bidirectional_L2/lstm_cell_78/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_9/backward_bidirectional_L2/lstm_cell_78/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_9/backward_bidirectional_L2/lstm_cell_78/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [16, 2], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [2], "dtype": "float32"}]}]}