{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 51], "dtype": "float32", "sparse": false, "ragged": false, "name": "landmark_input"}, "name": "landmark_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "angle_input"}, "name": "angle_input", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_L1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 2}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 3}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 4}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_4", "inbound_nodes": [[["landmark_input", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_6", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_A1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 8}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 9}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 10}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_6", "inbound_nodes": [[["angle_input", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_L2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 14}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 15}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 16}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_5", "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_7", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bidirectional_A2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 20}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 21}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 22}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_7", "inbound_nodes": [[["bidirectional_6", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "LSTM_L3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 26}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 27}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 28}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "LSTM_L3", "inbound_nodes": [[["bidirectional_5", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "LSTM_A3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 31}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 32}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 33}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "LSTM_A3", "inbound_nodes": [[["bidirectional_7", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["LSTM_L3", 0, 0, {}], ["LSTM_A3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["landmark_input", 0, 0], ["angle_input", 0, 0]], "output_layers": [["dense_5", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "AUC", "config": {"name": "auc_1", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "label_weights": null}}, {"class_name": "Precision", "config": {"name": "precision_1", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall_1", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "LSTM_A3/lstm_cell_55/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "LSTM_A3/lstm_cell_55/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "LSTM_A3/lstm_cell_55/bias", "shape": [256], "dtype": "float32"}, {"name": "LSTM_L3/lstm_cell_54/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "LSTM_L3/lstm_cell_54/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "LSTM_L3/lstm_cell_54/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_4/forward_bidirectional_L1/lstm_cell_43/kernel", "shape": [51, 256], "dtype": "float32"}, {"name": "bidirectional_4/forward_bidirectional_L1/lstm_cell_43/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_4/forward_bidirectional_L1/lstm_cell_43/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_4/backward_bidirectional_L1/lstm_cell_44/kernel", "shape": [51, 256], "dtype": "float32"}, {"name": "bidirectional_4/backward_bidirectional_L1/lstm_cell_44/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_4/backward_bidirectional_L1/lstm_cell_44/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_5/forward_bidirectional_L2/lstm_cell_49/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_5/forward_bidirectional_L2/lstm_cell_49/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_5/forward_bidirectional_L2/lstm_cell_49/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_5/backward_bidirectional_L2/lstm_cell_50/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_5/backward_bidirectional_L2/lstm_cell_50/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_5/backward_bidirectional_L2/lstm_cell_50/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_6/forward_bidirectional_A1/lstm_cell_46/kernel", "shape": [10, 256], "dtype": "float32"}, {"name": "bidirectional_6/forward_bidirectional_A1/lstm_cell_46/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_6/forward_bidirectional_A1/lstm_cell_46/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_6/backward_bidirectional_A1/lstm_cell_47/kernel", "shape": [10, 256], "dtype": "float32"}, {"name": "bidirectional_6/backward_bidirectional_A1/lstm_cell_47/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_6/backward_bidirectional_A1/lstm_cell_47/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_7/forward_bidirectional_A2/lstm_cell_52/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_7/forward_bidirectional_A2/lstm_cell_52/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_7/forward_bidirectional_A2/lstm_cell_52/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_7/backward_bidirectional_A2/lstm_cell_53/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_7/backward_bidirectional_A2/lstm_cell_53/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_7/backward_bidirectional_A2/lstm_cell_53/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [16, 2], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [2], "dtype": "float32"}]}]}